Infineon/mtb-example-psoc4-msclp-capsense-low-power/main.c
    /* Set the CAPSENSE&trade; data structure as the I2C buffer to be exposed to the
     * master on primary slave address interface. Any I2C host tools such as
     * the Tuner or the Bridge Control Panel can read this buffer but you can
     * connect only one tool at a time.
     */
    Cy_SCB_EZI2C_SetBuffer1(CYBSP_EZI2C_HW, (uint8_t *)&cy_capsense_tuner,
                            sizeof(cy_capsense_tuner), sizeof(cy_capsense_tuner),
                            &ezi2c_context);

    Cy_SCB_EZI2C_Enable(CYBSP_EZI2C_HW);

}

/*******************************************************************************
* Function Name: ezi2c_isr
********************************************************************************
* Summary:
*  Wrapper function for handling interrupts from EZI2C block.
*
*******************************************************************************/
static void ezi2c_isr(void)
{
    Cy_SCB_EZI2C_Interrupt(CYBSP_EZI2C_HW, &ezi2c_context);
}

#if ENABLE_RUN_TIME_MEASUREMENT
/*******************************************************************************
* Function Name: init_sys_tick
********************************************************************************
* Summary:
*  initializes the system tick with highest possible value to start counting down.
*
*******************************************************************************/
static void init_sys_tick()
{
    Cy_SysTick_Init (CY_SYSTICK_CLOCK_SOURCE_CLK_CPU ,0x00FFFFFF);
}
#endif

#if CY_CAPSENSE_BIST_EN
/*******************************************************************************
* Function Name: measure_sensor_capacitance
********************************************************************************
* Summary:
*  Measure the sensor Capacitance of all sensors configured and stores the values in an array using BIST.
*  BIST Measurements are taken by Connection connecting ISC to Shield.
*  It is based on actual application configuration.
* Parameters:
*   sensor_capacitance - This array holds the measured sensor capacitance values.
*                        array values are arranged as regular widget sensors first and
*                        followed by Low power widget sensors . refer configurator for the
*                        sensor order.
*******************************************************************************/
static void measure_sensor_capacitance(uint32_t *sensor_capacitance)
{
    /* For BIST configuration Connecting all Inactive sensor connections (ISC) of CSD sensors to to shield*/
    Cy_CapSense_SetInactiveElectrodeState(CY_CAPSENSE_SNS_CONNECTION_SHIELD,
    CY_CAPSENSE_BIST_CSD_GROUP, &cy_capsense_context);

    /*Runs the BIST to measure the sensor capacitance*/
    Cy_CapSense_RunSelfTest(CY_CAPSENSE_BIST_SNS_CAP_MASK,
            &cy_capsense_context);
    memcpy(sensor_capacitance,
            cy_capsense_context.ptrWdConfig->ptrSnsCapacitance,
            CY_CAPSENSE_SENSOR_COUNT * sizeof(uint32_t));
}

#endif

#if ENABLE_RUN_TIME_MEASUREMENT
/*******************************************************************************
* Function Name: start_runtime_measurement
********************************************************************************
* Summary:
*  Initializes the system tick counter by calling Cy_SysTick_Clear() API.
*******************************************************************************/
static void start_runtime_measurement()
{
    Cy_SysTick_Clear();
}

/*******************************************************************************
* Function Name: stop_runtime_measurement
********************************************************************************
* Summary:
*  Reads the system tick and converts to time in microseconds(us).
*
*  Returns:
*  runtime - in microseconds(us)
*******************************************************************************/

static uint32_t stop_runtime_measurement()
{
uint32_t ticks;
    uint32_t runtime;
    ticks=Cy_SysTick_GetValue();
    ticks= SYS_TICK_INTERVAL - Cy_SysTick_GetValue();
    runtime=ticks*TIME_PER_TICK_IN_US;
    return runtime;
}
#endif




#if ENABLE_SPI_SERIAL_LED
/*******************************************************************************
* Function Name: led_control
********************************************************************************
* Summary:
*  Control LED1 in the kit to show the button status:
*    No touch - LED1 == OFF
*    Touch - LED1 == RED
*
*  Control LED2 in the kit to show the device power mode:
*    Active mode - LED2 == RED
*    ALR mode - LED2 == YELLOW
*    WOT mode - LED2 == GREEN
*
*  LED3 is not used and always OFF
*
* Parameters:
*  DEVICE_STATE - device power mode state
*******************************************************************************/
void led_control()
{
    uint8_t brightness_red = 200u;
    uint8_t brightness_green = 200u;

    /* LED1 Control: Check the status of Active mode sensors and control LED1 */
    if(Cy_CapSense_IsAnyWidgetActive(&cy_capsense_context))
    {
        /* LED1 Turns on (RED color) when there is touch detected */
        led_context.led_num[LED1].color_red = brightness_red;
        led_context.led_num[LED1].color_green = 0u;
        led_context.led_num[LED1].color_blue = 0u;
    }
    else
    {
        /* LED1 Turns OFF when there is no touch detected */
        led_context.led_num[LED1].color_red = 0u;
        led_context.led_num[LED1].color_green = 0u;
        led_context.led_num[LED1].color_blue = 0u;
    }

    /* LED2 Control: Based on application power mode */
    switch(capsense_state){
        case ACTIVE_MODE:

            /* LED2 Turns on (RED color) while in ACTIVE mode */
            led_context.led_num[LED2].color_red = brightness_red;
            led_context.led_num[LED2].color_green = 0u;
            led_context.led_num[LED2].color_blue = 0u;

            break;

        case ALR_MODE:

            /* LED2 Turns on (YELLOW color) while in ALR mode */
            led_context.led_num[LED2].color_red = brightness_red >> 1u;
            led_context.led_num[LED2].color_green = brightness_green >> 1u;
            led_context.led_num[LED2].color_blue = 0u;

            break;

        case WOT_MODE:

            /* LED2 Turns on (GREEN color) while in WOT mode */
            led_context.led_num[LED2].color_red = 0u;
            led_context.led_num[LED2].color_green = brightness_green;
            led_context.led_num[LED2].color_blue = 0u;

            break;

        default:
            /* Unknown power mode state. Unexpected situation. */
            CY_ASSERT(CY_ASSERT_FAILED);
            break;
    }

